# manuals
manual_script_ru = 'Сейчас я расскажу, что я умею:\n' \
                   '\n$ € £ ¥ ₣ - отправлю текущий курс одной из пяти мировых валют.\n' \
                   '\n🇷🇺 🇬🇧 🇰🇿 - поменять язык | тілді өзгерту | change the language\n' \
                   '\nℹ - отправлю текующую валютную пару\n' \
                   '\n ⚙ - помогу вспомнить, что я умею\n' \
                   '\n💱 - выбери пару флагов 🏳️🏴, отправь мне сумму 🏳️, которую тебе ' \
                   'надо перевести, и я отвечу тебе, сколько это в 🏴.\n' \
                   '\nЯ всегда помню последнюю валютную пару! Если последняя пара 🏳️🏴, то конвертировать её в  ' \
                   'пару 🏴🏳️ очень просто: просто выбери 🏳️ и отправь нужную сумму в 🏴. Я верну тебе валютную ' \
                   'пару 🏴🏳️.\n' \
                   '\nP.s. я конвертирую валюту по актуальному курсу центрального банка РФ!'


manual_script_en = "'Now I will tell you what I can do:\n" \
                   "\n$ € £ ¥ ₣ - I will send the current exchange rate of one of the five world currencies.\n " \
                   '\n🇷🇺 🇬🇧 🇰🇿 - поменять язык | тілді өзгерту | change the language\n' \
                   '\nℹ - I will send the current currency pair\n' \
                   "\n⚙ - choose a couple of flags 🏳️🏴, send me the amount 🏳️ you need to transfer, and I " \
                   "will tell you how much it is in 🏴. \n" \
                   "\n I always remember the last currency pair! If the last pair is 🏳️ 🏴 , then converting it to" \
                   " a pair of 🏴 🏳️ is very simple: just select 🏳️ and send the required amount to 🏴 . " \
                   "I will return you the currency pair 🏴 🏳️ . \n" \
                   "\nP.S. I will convert the currency at the current exchange rate of the central " \
                   "bank of the Russian Federation!'"


manual_script_kz = 'Қазір Мен не істей алатынымды айтамын:\n ' \
                   '\n$ € £ ¥ ¥ - бес әлемдік валютаның бірінің ағымдағы бағамын жіберемін.\n' \
                   '\n🇷🇺 🇬🇧 🇰🇿 - поменять язык | тілді өзгерту | change the language\n' \
                   '\nℹ - мен ағымдағы валюта жұбын жіберемін\n' \
                   '\n⚙ - мен не істей алатынымды есте сақтауға көмектесемін.\n' \
                   '\n💱 - екі жалаушаны таңдаңыз 🏳️ 🏴 , маған аудару керек 🏳 ️ сомасын жіберіңіз,мен сізге ' \
                   'қанша жауап беремін 🏴 . \n' \
                   '\nМен әрқашан соңғы валюта жұбы есімде! Егер соңғы жұп 🏳️ 🏴 болса, оны пару️ жұпына 🏴 🏳️' \
                   'түрлендіру өте қарапайым: жай 🏳️ таңдап, қажетті соманы 🏴 - ге жіберіңіз. Мен сізге ' \
                   'валюта жұбын қайтарамын️🏴 🏳️️.\n' \
                   '\nP. S. мен валютаны РФ Орталық банкінің өзекті бағамы бойынша Айырбастаймын!'


ru_dict = {

    'welcome_txt': 'Добро пожаловать, ',
    'im_txt': 'Я - ',
    'bot_replica_txt': ' Бот, созданный, чтобы конвертировать валюту',
    'try_again_txt': 'Давай попробуем снова',
    'choose_pair_txt': 'Выбери валютную пару',
    'currency_pair_txt': 'Валютная пара',
    'pair': 'Текущая валютная пара: ',

    'name_ru': 'Российский рубль',
    'name_au': 'Австралийский доллар',
    'name_az': 'Азербайджанский манат',
    'name_am': 'Армянский дирхам',
    'name_by': 'Белорусский рубль',
    'name_bg': 'Болграский лев',
    'name_br': 'Бразильский реал',
    'name_hu': 'Венгерский форинт',
    'name_kr': 'Корейский вон',
    'name_hk': 'Гонконгский доллар',
    'name_dk': 'Датская крона',
    'name_us': 'Доллар США',
    'name_eu': 'Евро',
    'name_in': 'Индийский рупий',
    'name_kz': 'Казахстанский тенге',
    'name_ca': 'Канадский доллар',
    'name_kg': 'Киргизский сом',
    'name_cn': 'Китайский юань',
    'name_md': 'Молдавский лей',
    'name_tm': 'Новый туркменский манат',
    'name_no': 'Норвежская крона',
    'name_pl': 'Польский злотый',
    'name_ro': 'Румынский лей',
    'name_tj': 'Таджикский сомони',
    'name_tr': 'Турецкая лира',
    'name_uz': 'Узбекский сом',
    'name_ua': 'Украинская гривна',
    'name_gb': 'Фунт стерлингов',
    'name_cz': 'Чешская крона',
    'name_se': 'Шведская крона',
    'name_ch': 'Швейцарский франк',
    'name_jp': 'Японская йена',

    'dollar by': 'Доллар по ',
    'euro by': 'Евро по ',
    'pound by': 'Фунт по ',
    'frank by': 'Франк по ',
    'jena by': 'Йена по ',

    'manual_script': manual_script_ru
}


en_dict = {

    'welcome_txt': 'Welcome, ',
    'im_txt': 'I am ',
    'bot_replica_txt': ', a bot created to convert currency',
    'try_again_txt': "Let's try again",
    'choose_pair_txt': 'Choose a currency pair',
    'currency_pair_txt': 'Currency pair',
    'pair': 'Current currency pair: ',

    'name_ru': 'Russian ruble',
    'name_au': 'Australian dollar',
    'name_az': 'Azerbaijani manat',
    'name_am': 'Armenian dirham',
    'name_by': 'Belarusian ruble',
    'name_bg': 'Bulgarian lion',
    'name_br': 'Brazilian real',
    'name_hu': 'Hungarian forint',
    'name_kr': 'Korean won',
    'name_hk': 'Hong Kong dollar',
    'name_dk': 'Danish crown',
    'name_us': 'US dollar',
    'name_eu': 'Euro',
    'name_in': 'Indian rupees',
    'name_kz': 'Kazakhstani tenge',
    'name_ca': 'Canadian dollar',
    'name_kg': 'Kyrgyz catfish',
    'name_cn': 'Chinese yuan',
    'name_md': 'Moldovan leu',
    'name_tm': 'New Turkmen manat',
    'name_no': 'Norwegian krone',
    'name_pl': 'Polish zloty',
    'name_ro': 'Romanian leu',
    'name_tj': 'Tajik somoni',
    'name_tr': 'Turkish lira',
    'name_uz': 'Uzbek som',
    'name_ua': 'Ukrainian hryvnia',
    'name_gb': 'Pound sterling',
    'name_cz': 'Czech crown',
    'name_se': 'Swedish krona',
    'name_ch': 'Swiss franc',
    'name_jp': 'Japanese yen',

    'dollar by': 'Dollar by ',
    'euro by': 'Euro by ',
    'pound by': 'Pound by ',
    'frank by': 'Frank by ',
    'jena by': 'Jena by ',

    'manual_script': manual_script_en
}


kz_dict = {

    'welcome_txt': 'Қош келдіңіздер, ',
    'im_txt': 'Мен ',
    'bot_replica_txt': 'валюта айырбастау үшін құрылған бот',
    'try_again_txt': "Тағы да қайталап көрейік",
    'choose_pair_txt': 'Валюта жұбын таңдаңыз',
    'currency_pair_txt': 'Валюталық жұп',
    'pair': 'Ағымдағы валюта жұбы: ',

    'name_ru': 'Ресей рублі',
    'name_au': 'Австралиялық доллар',
    "name_az": "Әзірбайжан манаты",
    'name_am': 'Армян дирхамы',
    'name_by': 'Беларусь рублі',
    'name_bg': 'Болгар арыстаны',
    'name_br': 'Бразилиялық реал',
    'name_hu': 'Венгр форинт',
    'name_kr': 'Корей воны',
    'name_hk': 'Гонконг доллары',
    'name_dk': 'Дат тәжі',
    'name_us': 'АҚШ доллары',
    'name_eu': 'Евро',
    'name_in': 'Үнді рупийлері',
    'name_kz': 'қазақстандық теңге',
    'name_ca': 'Канадалық доллар',
    'name_kg': 'Қырғыз сом',
    'name_cn': 'Қытай юаны',
    'name_md': 'молдавиялық лей',
    'name_tm': 'Жаңа түрікмен манаты',
    'name_no': 'Норвегиялық крон',
    'name_pl': 'поляк злоты',
    'name_ro': 'Румын лей',
    'name_tj': 'тәжік сомони',
    'name_tr': 'Түрік лирасы',
    'name_uz': 'Өзбек мысық',
    'name_ua': 'Украин гривнасы',
    'name_gb': 'Фунт стерлинг',
    'name_cz': 'Чех тәжі',
    'name_se': 'Швед кронасы',
    'name_ch': 'Швейцариялық франк',
    'name_jp': 'Жапон йенасы',

    'dollar by': 'Доллар ',
    'euro by': 'Eвроға ',
    'pound by': 'Фунт ',
    'frank by': 'Франк ',
    'jena by': 'Иен ',

    'manual_script': manual_script_kz
}
